<?php

namespace hanbj;

class HBConfig
{
    // 维护者：神棍
    const CODER = '坎丙午';
    // 内网用户：会长层 + 素问，花西，魁儿，漢家彬彬，面具
    const FIXED = [self::CODER, '坤丁酉', '离丙申', '乾壬申', '商乙未', '乾乙丑'];
    // 活动扫码工作人员：会长层 + 部长层 + 神棍，魁儿，花西，哈利，
    // 紫菀，陌上歌未央，狼破军魂，何处画夕阳，姑娘_请回眸，
    // 第三颗耳洞，Li秋林，飞飞，颜真真
    const WORKER = [self::CODER, '乾壬申', '离丙申', '巽丁巳',
        '离庚寅', '兑壬子', '兑癸卯', '兑癸巳', '兑甲辰',
        '兑庚午', '兑丙子', '夏辛未', '夏庚子'];
    // 本届吧务组年代
    const YEAR = 16;
    // 收个开放号码ID
    const FIRST_UNAME_ID = 863;
}
