var align = {
    lg: {
        t: "守序善良",
        v: "守序善良的人物相信，规律而强大的社会和高尚的政府，可以让大多数人民生活得更好。只要人们相信法律，并试着互相帮助，整个社会就将因此而进步。因此，这个阵营的人物将会朝着这个方向努力，他们会尽可能地为大多数人带来较多的福利及较少的伤害。他们必定信守自己的承诺。守序善良的人物，特别是圣武士，时常自己陷于善良与法律相冲突的两难处境。比如履行誓言可能会伤及无辜时，或在宗教法规和地方法律相矛盾时。"
    },
    ng: {
        t: "中立善良",
        v: "中立善良的人物相信力量平衡是十分重要的事，单方面地强调秩序或混乱，是无法达到至善的。因为整个宇宙中充满了朝着各式各样的目标而努力的生物，所以若要追求至善，便不能破坏这种平衡，甚至的设法维持这种平衡，如果说支持社会秩序可以带来至善，便得以为之。若推翻既有的社会秩序就可以达到至善，那也必须为之。社会结构对他们来说，没什么重大意义。中立善良的长处是，行善不为阶级偏见所影响。"
    },
    cg: {
        t: "混乱善良",
        v: "混乱善良的人物虽然喜欢按照自己的意思行事，心地却不错。尽管他们认同一切美德和公理，却不愿意受到律法和规范的约束。想要任意驱使这些人，要他们遵照命令做事是不可能的。这些人有自己的一套道德标准，虽然不至于为恶，但也不见得和一般大众的道德标准完全相同。混乱善良人物常会因为感到受人指使而在团队内制造矛盾，比起有计划的行动他们更喜欢即兴发挥。混乱善良阵营的人物不介意用恶毒的手段制裁他们认为是邪恶的人，即便并不喜欢这样做，但他们本身却并不带有恶意。"
    },
    ln: {
        t: "守序中立",
        v: "守序中立的人物而言，秩序和组织是非常重要的。他们认同强大、井然有序的统治阶层，不管这个统治阶层是专制的暴君，还是安和乐利的民主政府，这些人都不在乎，世界上必须有法律，而法律则必须被遵守。对他们而言，绝对的秩序比什么道德良知来的重要。只要是规定，不管结果是好是坏，都必须遵行无误。绝对公正的法官，和绝对服从命令的士兵，都是此阵营的最佳典范。守序中立对善恶持中立态度，但这不代表他们是不道德的、是道德虚无主义者或是没有道德立场。他们只不过是将道德观念永远置于服从信条、传统或者法律之下。他们通常有强烈的伦理信条，但这一信条是首先基于其信念体系，而非基于善恶认同。"
    },
    nn: {
        t: "绝对中立",
        v: "绝对中立的人物相信绝对平衡的力量，因此，他们拒绝采取任何被视为邪恶和暴力的行动。绝对中立的人会尽力避免和善良或邪恶，秩序或叛逆的力量合流。有时候他们发现自己被迫得和某个阵营结盟。为了保持平衡，这些人会刻意改变立场，和弱势者合作。然而，当强弱势力对换时，他们也会毫不犹豫地跟着改变立场。"
    },
    cn: {
        t: "混乱中立",
        v: "混乱中立的人按自己一时的兴致行动。他是一个完全的个人主义者。他重视自己的自由权利，但并不致力于保护别人的自由。他蔑视权威，愤恨约束并且挑战传统。混乱中立者并不会向无政府运动那样有意瓦解组织。如果这么做，他必须把自己的阵营转成善良(希望解放他人)或是邪恶(使异己受苦)。混乱中立的寻常称谓是“真正混乱”。注意，混乱中立者的行为也许很难预测，但他的举止并非完全随机的，他从桥上的走过去的可能性和从桥上跳下去的可能性大小并不相等。混乱中立是一个真正自由于社会约束和对改良社会的空想的阵营。"
    },
    le: {
        t: "守序邪恶",
        v: "守序邪恶的人有系统地得到他想要的东西，此行为受到他行为准则的限制，但并不顾及受其伤害的人。他关心传统、忠诚和秩序，但不关心自由、尊严和生命。他按规则行动，但没有怜悯和同情。他觉得待在统治阶层里很舒服，愿意支配别人，但也乐意为别人服务。他处罚谴责别人并不是根据他们的行为而是根据种族、信仰、祖国或社会阶层。他不愿违反法律或承诺，这种不愿部分是因为他的天性，部分是因为他需要秩序来保护他免受道德上的反对。某些守序邪恶者有特别的禁忌，比如不冷血嗜杀(但让属下去做)或不伤害儿童(如果可能的话)。他们认为这些良心上的原则使自己比一般不合人道的恶人水准高。诡计多端扩展自己势力并他的压迫人民的贵族是一个守序邪恶的例子。某些守序邪恶的人或生物狂热的效忠于邪恶，就好像十字军效忠于良善一样。伤害别人是他们这么做的目的，传播邪恶本身也是他们乐于如此的原因。他们也可能认为行恶是对某种邪恶神明或主人的责任的一部分。守序邪恶有时被称为“恶魔般的”，因为恶魔是守序邪恶的化身和典型。守序邪恶是一个有方法有意图并且能常常有所成就的邪恶阵营。"
    },
    ne: {
        t: "中立邪恶",
        v: "中立邪恶的人物为了自己可以做出任何事，一切都是为了自己，就这么简单。他们从不为死在手下的人掉泪，不论是为财、为了高兴或只是为了方便。他们不喜欢纪律，也不遵守法律、传统或任何高贵的信念。然而，他们也不像混乱邪恶者那样浮躁不安，或热爱冲突。有些中立邪恶者将邪恶视为一种理想，想要献身于邪恶。这种恶人大多是邪恶神祇或秘密组织的成员。一般人习惯将中立邪恶称为“真正的邪恶”。中立邪恶的可怕在于表现出全然的邪恶，完全没有荣誉感和对象区别。"
    },
    ce: {
        t: "混乱邪恶",
        v: "混乱邪恶的人物会因为贪婪、憎恨或欲望而做出任何事。他暴躁易怒、满怀恶意、独断暴力而且无法预料。为了得到想要的东西，他会冲动而鲁莽地行动，散播邪恶与混乱。所幸他的计划大多杂乱无章，其团体大多组织散乱。一般而言，混乱邪恶者只有被强迫时才会与人合作，其领袖常要面对斗争与暗杀。混乱邪恶的可怕在于不仅破坏美丽与生命，也破坏了美丽与生命赖以存在的秩序。"
    }
};
var survey = [
    {
        head: '第一卷：对亲戚的看法',
        body: [
            {
                q: '长辈在家族中公开反对你，你会：',
                a: [
                    {t: '接受批评，改变方法', v: 'xg-2'},
                    {t: '尝试与长辈妥协，用折衷的方法', v: 'xg-1'},
                    {t: '忽略长辈的轻蔑，诽谤他们', v: 'xe-1'},
                    {t: '千方百计使他们收声', v: 'xe-2'}
                ]
            },
            {
                q: '你会放弃一个前途无量的职业来帮忙解决家庭的燃眉之急吗？',
                a: [
                    {t: '不用想，肯定会', v: 'xg-2'},
                    {t: '会，但有点不情愿', v: 'xg-1'},
                    {t: '除非我肯定我会很快重回工作岗位', v: 'xn-1'},
                    {t: '不会', v: 'xn-2'}
                ]
            },
            {
                q: '你会为了前途而背叛家人吗？',
                a: [
                    {t: '会，不带一点罪恶感', v: 'xe-2'},
                    {t: '会——只要我能秘密行事', v: 'xe-1'},
                    {t: '我会抗拒这诱惑', v: 'xn-1'},
                    {t: '我认为这个主意极为可恨', v: 'xn-2'}
                ]
            },
            {
                q: '你尊敬一家之主吗？',
                a: [
                    {t: '他们的言语指导着我的行动', v: 'lx-2'},
                    {t: '他们是我的榜样', v: 'lx-1'},
                    {t: '他们通常都与我无关', v: 'cx-1'},
                    {t: '我当他们透明', v: 'cx-2'}
                ]
            },
            {
                q: '如果家族要你与一个令人作呕的家伙结婚，你会：',
                a: [
                    {t: '听从安排，为能帮助家族而自豪', v: 'lx-2'},
                    {t: '会，但强颜欢笑', v: 'lx-1'},
                    {t: '巧妙地抗婚', v: 'nx-1'},
                    {t: '逃跑', v: 'nx-2'}
                ]
            },
            {
                q: '有一位家人疏远了你。在他弥留之际，他想与你和解。你会：',
                a: [
                    {t: '与他谈谈，但坚守立场', v: 'cx-2'},
                    {t: '不跟他说话', v: 'cx-1'},
                    {t: '不计前嫌敞开心扉地讨论前事', v: 'nx-1'},
                    {t: '积极进行和解，并留心听他的遗言', v: 'nx-2'}
                ]
            }
        ]
    },
    {
        head: '第二卷：对朋友的看法',
        body: [
            {
                q: '一个位高权重的腐败法官允诺如果你能作对你朋友不利的假证，他便给你一大笔钱。你会：',
                a: [
                    {t: '照做，然后拿钱', v: 'xe-2'},
                    {t: '拿钱照做，但尽量使证词显得无力', v: 'xe-1'},
                    {t: '拒绝', v: 'xg-1'},
                    {t: '不管结果如何，都站在朋友那一边', v: 'xg-2'}
                ]
            },
            {
                q: '你会亲近朋友，还是与大部分人保持一段距离以保安全？',
                a: [
                    {t: '我有一大群密友', v: 'xg-2'},
                    {t: '我有些密友', v: 'xg-1'},
                    {t: '我有几个密友', v: 'xn-1'},
                    {t: '我会与人保持距离', v: 'xn-2'}
                ]
            },
            {
                q: '你背叛过朋友吗？',
                a: [
                    {t: '我干过不止一次，有时也能逃避惩罚', v: 'xe-2'},
                    {t: '我只干过那么一次', v: 'xe-1'},
                    {t: '我曾被怂恿过这么做，但从未做过', v: 'xn-1'},
                    {t: '我从未考虑过这种事', v: 'xn-2'}
                ]
            },
            {
                q: '你怎么看待“执子之手，与子偕老”这类对爱人的终生承诺？',
                a: [
                    {t: '我曾有过或正渴望着这么一段罗曼史', v: 'lx-2'},
                    {t: '这种罗曼史挺理想的——如果能成功的话', v: 'lx-1'},
                    {t: '我担心我会错过其他人对我的爱', v: 'cx-1'},
                    {t: '作茧自缚？真是天大的错误', v: 'cx-2'}
                ]
            },
            {
                q: '朋友借了你钱，你会要他们还吗？',
                a: [
                    {t: '会，而且写好借据，不得抵赖', v: 'lx-2'},
                    {t: '会，但期限上会宽松些', v: 'lx-1'},
                    {t: '不会，尽管还了会更好', v: 'nx-1'},
                    {t: '不会，他们欠我一个人情', v: 'nx-2'}
                ]
            },
            {
                q: '你仍与儿时玩伴保持联络吗？',
                a: [
                    {t: '是的，我们定期通信', v: 'nx-2'},
                    {t: '是的，我们努力保持联络', v: 'nx-1'},
                    {t: '不会，我经常搬家', v: 'cx-1'},
                    {t: '不会，我不再与他们有共同之处', v: 'cx-2'}
                ]
            }
        ]
    },
    {
        head: '第三卷：对集体的看法',
        body: [
            {
                q: '你会花时间和金钱在集体上吗？',
                a: [
                    {t: '会，我会优先考虑集体的需要', v: 'xg-2'},
                    {t: '如果我的需求被满足的话，我会尽我所能', v: 'xg-1'},
                    {t: '不会，我没钱也不闲', v: 'xn-1'},
                    {t: '不会，花时间和金钱在集体上是一种浪费', v: 'xn-2'}
                ]
            },
            {
                q: '集体面临被侵害的威胁，你会：',
                a: [
                    {t: '保卫它直至自己的最后一口气', v: 'xg-2'},
                    {t: '和残存同伴构筑防御', v: 'xg-1'},
                    {t: '一看到势头不对就逃跑', v: 'xe-1'},
                    {t: '与入侵者达成协议，成为间谍', v: 'xe-2'}
                ]
            },
            {
                q: '如果你受伤了，需要急救，你的同伴愿意帮助你吗？',
                a: [
                    {t: '会的，因为他们知道我也会为他们做同样的事', v: 'xn-2'},
                    {t: '会的，因为我很受欢迎', v: 'xn-1'},
                    {t: '可能不会，因为我不受信任', v: 'xe-1'},
                    {t: '肯定不会，我在集体中树敌了', v: 'xe-2'}
                ]
            },
            {
                q: '你尊重集体的规章和领袖吗？',
                a: [
                    {t: '毋庸置疑，是的', v: 'lx-2'},
                    {t: '是的，总的来说他们是最佳的管理方式', v: 'lx-1'},
                    {t: '当它适合我时，我才会——有些规章我并不认同', v: 'cx-1'},
                    {t: '我不关心他们；他们拿我没辙', v: 'cx-2'}
                ]
            },
            {
                q: '同伴回避你，或嘲笑你吗？',
                a: [
                    {t: '是的，这些井底之蛙不会理解超规格的人', v: 'cx-2'},
                    {t: '有些会，因为并不是所有人都认同我', v: 'cx-1'},
                    {t: '不会，我看起来一切正常', v: 'nx-1'},
                    {t: '不会，我就是集体中的正常人的标准', v: 'nx-2'}
                ]
            },
            {
                q: '你当官会为民作主，或者希望代表集体的意志吗？',
                a: [
                    {t: '做这种事是我所乐意接受的荣誉', v: 'lx-2'},
                    {t: '当然。这是每个人的义务', v: 'lx-1'},
                    {t: '不会，除非无人能接手此事', v: 'nx-1'},
                    {t: '不会，我不想为集体利益负责', v: 'nx-2'}
                ]
            }
        ]
    },
    {
        head: '第四卷：对国家的看法',
        body: [
            {
                q: '你的国家闹饥荒，你会：',
                a: [
                    {t: '与其他人共享自己有的食物', v: 'xg-2'},
                    {t: '自己吃尽可能少，余下的给其他人', v: 'xg-1'},
                    {t: '偷取自己生存所需食物', v: 'xe-1'},
                    {t: '偷取尽可能多的食物，然后高价卖出', v: 'xe-2'}
                ]
            },
            {
                q: '给你足够的钱，你会往国王的酒中下毒吗？',
                a: [
                    {t: '会，类似的事我干过了', v: 'xe-2'},
                    {t: '如果我能逃避惩罚的话，我会的', v: 'xe-1'},
                    {t: '不会，尽管我觉得这一大笔钱很诱人', v: 'xn-1'},
                    {t: '不会，而且我会叫国王小心这个阴谋', v: 'xn-2'}
                ]
            },
            {
                q: '瘟疫传遍你的国家，你会：',
                a: [
                    {t: '接下寻求解药的危险任务', v: 'xg-2'},
                    {t: '尽力治好病人', v: 'xg-1'},
                    {t: '避免接触到病人', v: 'xn-1'},
                    {t: '逃离国家', v: 'xn-2'}
                ]
            },
            {
                q: '你尊重领主的法律权威吗？',
                a: [
                    {t: '是的，X主席万岁！', v: 'lx-2'},
                    {t: '是的，我们的统治者大体上是公平、公正的', v: 'lx-1'},
                    {t: '不会，统治者还不是人一个！', v: 'cx-1'},
                    {t: '不会，权力必定导致腐化', v: 'cx-2'}
                ]
            },
            {
                q: '给你一笔稳赚的生意，你会为敌国做间谍吗？',
                a: [
                    {t: '会，因为我的国家势必任人鱼肉', v: 'cx-2'},
                    {t: '会，因为国家机密对我无关紧要', v: 'cx-1'},
                    {t: '不会，我会被抓的', v: 'nx-1'},
                    {t: '不会，我不会辜负国家对我的信任', v: 'nx-2'}
                ]
            },
            {
                q: '你依靠政府来建立社会契约和保障所有权吗？',
                a: [
                    {t: '是的，因为维护法律比任何个人争执重要', v: 'lx-2'},
                    {t: '是的，因为法庭就是为了解决这种争执而设立的', v: 'lx-1'},
                    {t: '你在开玩笑吗？政府连路都不会铺', v: 'nx-1'},
                    {t: '绝对不会，如果我自己不能保护个人所有，我就无权拥有它', v: 'nx-2'}
                ]
            }
        ]
    },
    {
        head: '第五卷：对刑罚的看法',
        body: [
            {
                q: '如果你入狱了，你会伤害或杀死其他人而脱狱吗？',
                a: [
                    {t: '会，服刑这么多年等于锁住自己', v: 'xe-2'},
                    {t: '会，在犯事时便已知道这风险了', v: 'xe-1'},
                    {t: '不会，除非只造成容易愈合的小伤', v: 'xn-1'},
                    {t: '不会，那些守卫只是在尽本分而已', v: 'xn-2'}
                ]
            },
            {
                q: '你接受贵族有权恶劣对待手下的仆人吗？',
                a: [
                    {t: '是的，很幸运，贵族们投了个好胎', v: 'xn-2'},
                    {t: '是的，有时要靠吓，他们才肯干活', v: 'xn-1'},
                    {t: '不会，贵族应仁慈地统治', v: 'xg-1'},
                    {t: '任何人都无权恶劣对待别人。以上。', v: 'xg-2'}
                ]
            },
            {
                q: '你意外地犯罪了，你会：',
                a: [
                    {t: '认罪，并向受害者赔偿', v: 'xg-2'},
                    {t: '认罪，向法官请求宽大处理', v: 'xg-1'},
                    {t: '隐瞒自己的涉案事实，必要时说谎', v: 'xe-1'},
                    {t: '嫁祸于人', v: 'xe-2'}
                ]
            },
            {
                q: '如果犯罪了，你会认罪吗？',
                a: [
                    {t: '会，因为我有这个责任', v: 'lx-2'},
                    {t: '会，因为我会因此获得轻判', v: 'lx-1'},
                    {t: '不会，我会等到检察官证明我有罪', v: 'nx-1'},
                    {t: '不会，我会证明我“无罪”的', v: 'nx-2'}
                ]
            },
            {
                q: '如果可能被惩罚，你会表明一个革命性的政见吗？',
                a: [
                    {t: '会，我宁愿受罚也不愿保持沉默', v: 'cx-2'},
                    {t: '会，总要有人说真话', v: 'cx-1'},
                    {t: '不会，尽管私底下我会对朋友说', v: 'nx-1'},
                    {t: '不会，不值得为政治费神', v: 'nx-2'}
                ]
            },
            {
                q: '旅行时，你目击了一场袭击。你被传去作证，这会非常耽误你的行程。你会：',
                a: [
                    {t: '连夜溜走，避免作证', v: 'cx-2'},
                    {t: '说自己什么也没看到', v: 'cx-1'},
                    {t: '勉强留下，作证，然后离开', v: 'lx-1'},
                    {t: '留下直至结案所需证供足够', v: 'lx-2'}
                ]
            }
        ]
    },
    {
        head: '第六卷：对财富的看法',
        body: [
            {
                q: '财富的最大用途是什么？',
                a: [
                    {t: '帮助穷人和不幸的人', v: 'xg-2'},
                    {t: '满足亲朋戚友需要', v: 'xg-1'},
                    {t: '让自己达到人生巅峰', v: 'xe-1'},
                    {t: '不仅达到巅峰，还要阻止别人超过自己', v: 'xe-2'}
                ]
            },
            {
                q: '遇到乞丐，你会：',
                a: [
                    {t: '慷慨地给钱', v: 'xg-2'},
                    {t: '恰到好处地给钱', v: 'xg-1'},
                    {t: '只给我认为无所谓的钱——至多一两块', v: 'xn-1'},
                    {t: '视而不见', v: 'xn-2'}
                ]
            },
            {
                q: '通过魔法，你可以使村里的商人们以为你的铜币是金币。你会这样做吗？',
                a: [
                    {t: '会，而且我还要尽可能地消费', v: 'xe-2'},
                    {t: '会，但只骗富商', v: 'xe-1'},
                    {t: '不会，风险太大了', v: 'xn-1'},
                    {t: '不会，商人也要养家糊口啊', v: 'xn-2'}
                ]
            },
            {
                q: '你有两份工作可供选择。一份酬劳更多，另一份较稳定。你会选哪一份？',
                a: [
                    {t: '肯定是更赚钱的那份；稳定的工作听上去像苦差事', v: 'nx-2'},
                    {t: '可能是前者，尽管我会看看后者干些什么', v: 'nx-1'},
                    {t: '后者，除非前者赚的钱多到吓死人', v: 'lx-1'},
                    {t: '肯定是稳定的那份，因为我有长远的计划', v: 'lx-2'}
                ]
            },
            {
                q: '最佳的致富途径是什么？',
                a: [
                    {t: '这关乎天时地利，还有一时运气', v: 'cx-2'},
                    {t: '灵活变通会有更多机会', v: 'cx-1'},
                    {t: '按照一个有适度风险的长期计划来做', v: 'lx-1'},
                    {t: '努力工作，坚持不懈', v: 'lx-2'}
                ]
            },
            {
                q: '如果你接手一项工作，尽管它会很危险，你会努力完成吗？',
                a: [
                    {t: '会，我说话算数', v: 'nx-2'},
                    {t: '会，因为人家会认为我信得过，这很好', v: 'nx-1'},
                    {t: '你可以赌我会否爽约', v: 'cx-1'},
                    {t: '如果这不是什么好差事，那算了吧', v: 'cx-2'}
                ]
            }
        ]
    }
];
var dnd = (function ($, Vue, w, undefined) {
    'use strict';
    var vmain, f_ret = {}, ret = {cx: 0, lx: 0, nx: 0, xe: 0, xg: 0, xn: 0}, f_max = 'nn';
    var front = function (n) {
        return n.lx > n.nx && n.lx > n.cx ? "l" : n.cx > n.nx && n.cx > n.lx ? "c" : "n";
    };
    var end = function (n) {
        return n.xg > n.xe && n.xg > n.xn ? "g" : n.xe > n.xn && n.xe > n.xg ? "e" : "n";
    };
    var d_radar = function (anchor, k_data, v_data) {
        var myChart = echarts.init(document.getElementById(anchor));
        var option = {
            radar: {
                name: {
                    textStyle: {
                        color: '#fff',
                        backgroundColor: '#999',
                        borderRadius: 3,
                        padding: [3, 5]
                    }
                },
                indicator: k_data
            },
            series: [{
                type: 'radar',
                itemStyle: {normal: {areaStyle: {type: 'default'}}},
                data: [
                    {
                        value: v_data
                    }
                ]
            }]
        };
        myChart.setOption(option);
    };
    var build_vue = function () {
        vmain = new Vue({
            el: '#survey',
            data: {
                bg: ["bg-success", "bg-info", "bg-warning", "bg-danger"],
                sections: survey,
                state: undefined
            },
            methods: {
                sub: function (ans, v) {
                    ans.done = true;
                    v = v.split('-');
                    var k = v[0];
                    v = parseInt(v[1]);
                    ret[k] += v;

                    Object.keys(align).forEach(function (idx) {
                        if (idx.charAt(0) === k.charAt(0) || idx.charAt(1) === k.charAt(1)) {
                            f_ret[idx] += v;
                            if (f_ret[idx] > f_ret[f_max]) {
                                f_max = idx;
                            }
                        }
                    });

                    var cnt = 0;
                    Object.keys(align).forEach(function (idx) {
                        if (f_ret[f_max] === f_ret[idx]) {
                            cnt++;
                        }
                    });

                    var state = f_max;
                    if (cnt > 1) {
                        state = front(ret) + end(ret);
                    }
                    vmain.state = align[state];
                },
                detail: function () {
                    var k_data = [], v_data = [];
                    Object.keys(align).forEach(function (idx) {
                        k_data.push({name: align[idx].t, max: 48});
                        v_data.push(f_ret[idx]);
                    });
                    d_radar('dnd_join1', k_data, v_data);
                    d_radar('dnd_join2', [{name: '守序', max: 24}, {name: '中立', max: 24}, {name: '混乱', max: 24}], [ret.lx, ret.nx, ret.cx]);
                    d_radar('dnd_join3', [{name: '善良', max: 24}, {name: '中立', max: 24}, {name: '邪恶', max: 24}], [ret.xg, ret.xn, ret.xe]);
                }
            },
            ready: function () {
                Object.keys(align).forEach(function (idx) {
                    f_ret[idx] = 0;
                });
            }
        });
    };
    var adj_data = function () {
        for (var i in survey) {
            for (var j in survey[i].body) {
                survey[i].body[j].done = false;
            }
        }
    };
    var init = function () {
        adj_data();
        build_vue();
    };
    return {
        init: init
    };
})(jQuery, Vue, window);